Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
              = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-sendJobEmail/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/sendJobEmail'"
          + "filename_new"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "filename_old"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-sendJobEmail"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-sendJobEmail"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-sendJobEmail-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-sendJobEmail:*:*",
                          + "arn:aws:logs:*:438465168484:log-group:/aws/lambda/svep-backend-sendJobEmail:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-sendJobEmail"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-sendJobEmail",
        ]
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-sendJobEmail-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-sendJobEmail",
        ]
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-updateReferenceFiles"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-updateReferenceFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-updateReferenceFiles-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-updateReferenceFiles"
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-updateReferenceFiles-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-updateReferenceFiles"
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Retrieves latest reference files and updates the reference bucket in S3"
      + filename                       = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
      + function_name                  = "svep-backend-updateReferenceFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
          + "timestamp" = "1747983278678752800"
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "python libraries"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "svep_backend_python_modules_layer"
      + s3_bucket                   = (known after apply)
      + s3_key                      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
          + "timestamp" = "1747983278948820200"
        }
    }

Plan: 1100 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + admin_login_command  = (known after apply)
  + api_url              = (known after apply)
  + beacon_ui_url        = (known after apply)
  + cognito_client_id    = (known after apply)
  + cognito_user_pool_id = (known after apply)
  + guest_login_command  = (known after apply)
module.sbeacon.null_resource.init_script: Creating...
module.svep[0].null_resource.init_script: Creating...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/pluginClinvar'"]
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/cee30fb8891081495606fcc8bda7d367eb0a666a5a1d1134cf509ee98e3d4890.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/concatStarter'"]
module.sbeacon.null_resource.init_script: Provisioning with 'local-exec'...
module.sbeacon.null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryVCF'"]
module.svep[0].null_resource.init_script: Provisioning with 'local-exec'...
module.svep[0].null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/pluginGnomad'"]
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/4a89859d3ac26ed01ce68106ac473d8f64a03f1d9f1a39746c89dec5c812c300.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/concatPages'"]
module.sbeacon.null_resource.init_script (local-exec): Running init.sh in sbeacon
module.sbeacon.null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon
module.sbeacon.null_resource.init_script (local-exec): + LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries
module.sbeacon.null_resource.init_script (local-exec): + SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries ']'
module.sbeacon.null_resource.init_script (local-exec): + rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): Running init.sh in sbeacon
module.svep[0].null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon
module.svep[0].null_resource.init_script (local-exec): + LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): + SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries/source
module.svep[0].null_resource.init_script (local-exec): + '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries ']'
module.svep[0].null_resource.init_script (local-exec): + rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryVCFsubmit'"]
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-ry373sel
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/concatStarter
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-ry373sel/lambda_function.py
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): Created builds/cee30fb8891081495606fcc8bda7d367eb0a666a5a1d1134cf509ee98e3d4890.zip
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creation complete after 1s [id=1532916420756934339]
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/sendJobEmail'"]
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-p1albdp1
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryVCF
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-p1albdp1/lambda_function.py
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): Created builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-fnkfspii
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/pluginClinvar
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-fnkfspii/lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Created builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creation complete after 2s [id=3561883514287715393]
module.svep[0].module.lambda-formatOutput.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-formatOutput.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/formatOutput'"]
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-jpaac9a1
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/concatPages
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-jpaac9a1/lambda_function.py
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): Created builds/4a89859d3ac26ed01ce68106ac473d8f64a03f1d9f1a39746c89dec5c812c300.zip
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creation complete after 1s [id=4125855701972527006]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-ki58k93h
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/pluginGnomad
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-ki58k93h/lambda_function.py
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): Created builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/348ff4a2ecd60bb7e13417127b9f468919debce7db6fb705c90305f673a7bf45.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/getResultsURL'"]
module.sbeacon.null_resource.init_script (local-exec): + mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): + mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creation complete after 1s [id=3969990711656934086]
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/5fd14133963b9621f04ee996516760f773284c80ceefae86ebc9c29769abbb93.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/createPages'"]
module.sbeacon.null_resource.init_script (local-exec): + mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries/source
module.svep[0].null_resource.init_script (local-exec): mkdir: cannot create directory ‘/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries’: File exists
module.svep[0].null_resource.init_script (local-exec): Running init.sh in svep
module.sbeacon.null_resource.init_script (local-exec): + cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + wget https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.svep[0].null_resource.init_script (local-exec): ++ REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep
module.svep[0].null_resource.init_script (local-exec): ++ LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries
module.svep[0].null_resource.init_script (local-exec): ++ SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries/source
module.svep[0].null_resource.init_script (local-exec): ++ '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries ']'
module.svep[0].null_resource.init_script (local-exec): ++ rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creation complete after 1s [id=2760910742901133500]
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creating...
module.sbeacon.null_resource.init_script (local-exec): --2025-05-23 13:55:05--  https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/initQuery'"]
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-yyjfmdr3
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryVCFsubmit
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-yyjfmdr3/lambda_function.py
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Created builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creation complete after 1s [id=6744519388936404400]
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/21c6d203451c27ca52fb7052f23d336f201030312cca362109e3a36d9364d289.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/concat'"]
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-fc99k4yb
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/sendJobEmail
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-fc99k4yb/lambda_function.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-2jti69nk
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/concat
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-2jti69nk/lambda_function.py
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): Created builds/21c6d203451c27ca52fb7052f23d336f201030312cca362109e3a36d9364d289.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-9_mm_2y_
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/createPages
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-9_mm_2y_/lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Created builds/5fd14133963b9621f04ee996516760f773284c80ceefae86ebc9c29769abbb93.zip
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creation complete after 0s [id=6602688800415917873]
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Executing: ["/bin/sh" "-c" "python build.py 'builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryGTF'"]
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-nzbuy5ha
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/initQuery
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): cp dynamodb.py /tmp/terraform-aws-lambda-nzbuy5ha/dynamodb.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-nzbuy5ha/lambda_function.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Created builds/6318eafa8fc786264ab8e7f44348c7e585840819ef254b1c861d09048cab6246.zip
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creation complete after 0s [id=7263283527591503180]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-3mr95nlu
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/getResultsURL
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): cp dynamodb.py /tmp/terraform-aws-lambda-3mr95nlu/dynamodb.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-3mr95nlu/lambda_function.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created builds/348ff4a2ecd60bb7e13417127b9f468919debce7db6fb705c90305f673a7bf45.zip
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-7ozj04om
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/queryGTF
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-7ozj04om/lambda_function.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Created builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 0s [id=8501813096677767196]
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creation complete after 1s [id=8501833105563678642]
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creation complete after 1s [id=6664975761407416550]
module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (local-exec): mktemp -d
module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (local-exec): /tmp/terraform-aws-lambda-2g7fspyw
module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (local-exec): cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/lambda/formatOutput
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 1s [id=6861969082137218230]
module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (local-exec): cp lambda_function.py /tmp/terraform-aws-lambda-2g7fspyw/lambda_function.py
module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (local-exec): Created builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip
module.svep[0].module.lambda-formatOutput.null_resource.archive[0]: Creation complete after 1s [id=2554772480278937288]
module.sbeacon.null_resource.init_script (local-exec): Resolving github.com (github.com)... 20.205.243.166
module.svep[0].null_resource.init_script (local-exec): ++ mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries
module.sbeacon.null_resource.init_script (local-exec): Connecting to github.com (github.com)|20.205.243.166|:443... connected.
module.svep[0].null_resource.init_script (local-exec): ++ mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries/source
module.svep[0].null_resource.init_script (local-exec): ++ cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/170/default/svep/libraries/source
module.svep[0].null_resource.init_script (local-exec): ++ wget https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.svep[0].null_resource.init_script (local-exec): --2025-05-23 13:55:06--  https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0]: Creating...
module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0]: Creation complete after 0s [id=8286e92e01c300740aa98967af15769c8c183af1]
module.sbeacon.module.lambda-performQuery.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0]: Creating...
module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0]: Creation complete after 0s [id=176676d28396618f60da1352763e7b680c2bb866]
module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0]: Creation complete after 0s [id=57f11b382975668e11a3d3d4e3c32f524b30a549]
module.cognito.module.lambda-sendSvepJobEmail.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-performQuery.local_file.archive_plan[0]: Creation complete after 0s [id=dcbd821a0ab528d26b56d9695dabe68b49f81027]
module.cognito.module.lambda-sendRegistrationEmail.local_file.archive_plan[0]: Creation complete after 0s [id=90e1bebd010f41f3ac4173cffd0d1695ad20f969]
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=1c9fe1cfff614328ce9095332d26b67a8ee55677]
module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0]: Creation complete after 0s [id=f9b54682fcc1fbb4defbf72abc401632b23bd1c3]
module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getProjects.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-sendSvepJobEmail.local_file.archive_plan[0]: Creation complete after 0s [id=1c4c44e7745d3ad6775da137cf4ccb57f36e2df1]
module.sbeacon.null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.sbeacon.module.lambda-indexer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getProjects.local_file.archive_plan[0]: Creation complete after 0s [id=13f242f5af2fb58e66c2311f2b2419bbc6de7572]
module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0]: Creation complete after 0s [id=56eeaab5cf5eba7b6a1563323e3bf2f5cbc4cc3b]
module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-indexer.local_file.archive_plan[0]: Creation complete after 0s [id=d3379645d32b203828200e4304198b3d4b5e62b8]
module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0]: Creation complete after 0s [id=88fa436c4c397cbad41be2744c91f1d0665a895b]
module.svep[0].null_resource.init_script (local-exec): Resolving github.com (github.com)... 20.205.243.166
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=f4ad88d776bc52cbf68d467ca57d791833172317]
module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0]: Creation complete after 0s [id=7dcd38d3dc4bf5078c57a3709a0add20ec58ed1c]
module.svep[0].null_resource.init_script (local-exec): Connecting to github.com (github.com)|20.205.243.166|:443... connected.
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-splitQuery.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0]: Creation complete after 0s [id=db33ee8c0eaf0bfd3ae77199a22257c5fe90f6cd]
module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=41d0b40c5914d342b2748341234f08b97826747c]
module.svep[0].module.lambda-clearTempAndRegions.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-splitQuery.local_file.archive_plan[0]: Creation complete after 0s [id=ca01b7a78d2ec65f2af41c993e577cd88451a486]
module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0]: Creation complete after 0s [id=f8260f5af56fb4eb307e8963a1b0365e6b9d460a]
module.svep[0].module.lambda-clearTempAndRegions.local_file.archive_plan[0]: Creation complete after 0s [id=6f4b72e1d060c301d2083dce4d6cffbd03c9c5dc]
module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0]: Creation complete after 0s [id=1d294e7678fd787752bfb461a9ae5b3f509ea071]
module.sbeacon.module.lambda-generateCohortVCfs.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.local_file.archive_plan[0]: Creation complete after 0s [id=8307d3fe51d83b7a6ac4c8de8e43c6978e740835]
module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.local_file.archive_plan[0]: Creation complete after 0s [id=e88e3b04679387c6027e55394d0f7ee2c1f227dd]
module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0]: Creation complete after 0s [id=955873705c1d653a738c7e094008b93e1e160f0b]
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0]: Creation complete after 0s [id=2514280d852430c145c51eb74a20ca005f1156aa]
module.sbeacon.null_resource.init_script (local-exec): 302 Found
module.svep[0].null_resource.init_script (local-exec): HTTP request sent, awaiting response... 302 Found
module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0]: Creation complete after 0s [id=2d4b303a6488c5843c2643851e25655c98ce8f53]
module.sbeacon.null_resource.init_script (local-exec): Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250523%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250523T065506Z&X-Amz-Expires=300&X-Amz-Signature=b2a1592a1c17280c69114b4993e7fdd42397942ef7c49c3c881075cd27cd28ac&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream [following]
module.sbeacon.null_resource.init_script (local-exec): --2025-05-23 13:55:07--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250523%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250523T065506Z&X-Amz-Expires=300&X-Amz-Signature=b2a1592a1c17280c69114b4993e7fdd42397942ef7c49c3c881075cd27cd28ac&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.svep[0].null_resource.init_script (local-exec): Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250523%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250523T065506Z&X-Amz-Expires=300&X-Amz-Signature=b2a1592a1c17280c69114b4993e7fdd42397942ef7c49c3c881075cd27cd28ac&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream [following]
module.sbeacon.null_resource.init_script (local-exec): Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.111.133, 185.199.110.133, 185.199.109.133, ...
module.svep[0].null_resource.init_script (local-exec): --2025-05-23 13:55:07--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250523%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250523T065506Z&X-Amz-Expires=300&X-Amz-Signature=b2a1592a1c17280c69114b4993e7fdd42397942ef7c49c3c881075cd27cd28ac&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream
module.svep[0].null_resource.init_script (local-exec): Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
module.sbeacon.module.lambda-getMap.local_file.archive_plan[0]: Creating...
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=4d29c9be0cde50ff82e7398e17412b4b05338bc5]
module.sbeacon.null_resource.init_script (local-exec): Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.111.133|:443... connected.
module.svep[0].null_resource.init_script (local-exec): Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.108.133|:443... connected.
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=2e1361cdfe49851a3ffb1cb7cb2639ed6467bb50]
module.sbeacon.module.lambda-getMap.local_file.archive_plan[0]: Creation complete after 0s [id=1f65e1af79d7fa7cfce68a996300963bf3e1e54f]
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.webgui.aws_cloudfront_origin_access_control.bui-s3-distribution: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=178de3096ddef2d58eb4ab0d2cbeeef1655cda04]
module.webgui.aws_s3_bucket.bui-hosted-bucket: Creating...
module.svep[0].module.lambda-clearTempAndRegions.aws_cloudwatch_log_group.lambda[0]: Creating...
module.svep[0].aws_s3_bucket.svep-regions: Creating...
module.svep[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0]: Creating...
module.svep[0].aws_s3_bucket.svep-results: Creating...
module.svep[0].aws_s3_bucket.lambda-layers-bucket: Creating...
module.sbeacon.null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.svep[0].aws_dynamodb_table.svep_references: Creating...
module.svep[0].null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.svep[0].aws_s3_bucket.svep-temp: Creating...
module.svep[0].aws_s3_bucket.svep-references: Creating...
module.svep[0].module.lambda-pluginConsequence.aws_cloudwatch_log_group.lambda[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creation complete after 0s [id=613be1c9511a739edaf2ddbdd283b2409cedd42d]
module.svep[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0]: Creating...
module.svep[0].aws_sns_topic.pluginClinvar: Creating...
module.svep[0].aws_sns_topic.pluginClinvar: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:438465168484:svep-backend-pluginClinvar]
module.svep[0].aws_sns_topic.updateReferenceFiles: Creating...
module.svep[0].aws_sns_topic.updateReferenceFiles: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:438465168484:svep-backend-updateReferenceFiles]
module.svep[0].aws_sns_topic.pluginConsequence: Creating...
module.svep[0].aws_sns_topic.pluginConsequence: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:438465168484:svep-backend-pluginConsequence]
module.svep[0].aws_sns_topic.queryVCF: Creating...
module.svep[0].aws_sns_topic.queryVCF: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryVCF]
module.svep[0].aws_sns_topic.sendJobEmail: Creating...
module.svep[0].aws_cloudwatch_event_rule.update_references_trigger: Creating...
module.sbeacon.null_resource.init_script (local-exec): 200 OK
module.sbeacon.null_resource.init_script (local-exec): Length: 4781943 (4.6M) [application/octet-stream]
module.sbeacon.null_resource.init_script (local-exec): Saving to: ‘htslib-1.21.tar.bz2’

module.sbeacon.null_resource.init_script (local-exec):      0K .......... .......... .......... .......... ..........  1% 2.57M 2s
module.sbeacon.null_resource.init_script (local-exec):     50K .......... .......... .......... .......... ..........  2% 3.01M 2s
module.sbeacon.null_resource.init_script (local-exec):    100K .......... .......... .......... .......... ..........  3% 12.8M 1s
module.sbeacon.null_resource.init_script (local-exec):    150K .......... .......... .......... .......... ..........  4% 12.8M 1s
module.svep[0].null_resource.init_script (local-exec): 200 OK
module.svep[0].null_resource.init_script (local-exec): Length: 4781943 (4.6M) [application/octet-stream]
module.svep[0].null_resource.init_script (local-exec): Saving to: ‘htslib-1.21.tar.bz2’

module.sbeacon.null_resource.init_script (local-exec):    200K .......... .......... .......... .......... ..........  5% 5.14M 1s
module.sbeacon.null_resource.init_script (local-exec):    250K .......... .......... .......... .......... ..........  6% 22.1M 1s
module.sbeacon.null_resource.init_script (local-exec):    300K .......... .......... .......... .......... ..........  7% 18.6M 1s
module.svep[0].aws_sns_topic.sendJobEmail: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail]
module.sbeacon.null_resource.init_script (local-exec):    350K .......... .......... .......... .......... ..........  8% 19.5M 1s
module.sbeacon.null_resource.init_script (local-exec):    400K .......... .......... .......... .......... ..........  9% 37.1M 1s
module.sbeacon.null_resource.init_script (local-exec):    450K .......... .......... .......... .......... .......... 10% 48.7M 1s
module.svep[0].aws_sns_topic.pluginGnomad: Creating...
module.svep[0].null_resource.init_script (local-exec):      0K .......... .......... .......... .......... ..........  1% 2.56M 2s
module.sbeacon.null_resource.init_script (local-exec):    500K .......... .......... .......... .......... .......... 11% 5.85M 1s
module.sbeacon.null_resource.init_script (local-exec):    550K .......... .......... .......... .......... .......... 12% 31.6M 0s
module.sbeacon.null_resource.init_script (local-exec):    600K .......... .......... .......... .......... .......... 13% 47.4M 0s
module.sbeacon.null_resource.init_script (local-exec):    650K .......... .......... .......... .......... .......... 14% 48.4M 0s
module.sbeacon.null_resource.init_script (local-exec):    700K .......... .......... .......... .......... .......... 16% 35.3M 0s
module.svep[0].aws_cloudwatch_event_rule.update_references_trigger: Creation complete after 0s [id=svep_update_references_trigger]
module.sbeacon.null_resource.init_script (local-exec):    750K .......... .......... .......... .......... .......... 17%  106M 0s
module.sbeacon.null_resource.init_script (local-exec):    800K .......... .......... .......... .......... .......... 18% 39.6M 0s
module.sbeacon.null_resource.init_script (local-exec):    850K .......... .......... .......... .......... .......... 19% 46.0M 0s
module.sbeacon.null_resource.init_script (local-exec):    900K .......... .......... .......... .......... .......... 20% 49.2M 0s
module.sbeacon.null_resource.init_script (local-exec):    950K .......... .......... .......... .......... .......... 21%  245M 0s
module.svep[0].null_resource.init_script (local-exec):     50K .......... .......... .......... .......... ..........  2% 3.36M 2s
module.svep[0].aws_sns_topic.concat: Creating...
module.svep[0].null_resource.init_script (local-exec):    100K .......... .......... .......... .......... ..........  3% 11.9M 1s
module.svep[0].null_resource.init_script (local-exec):    150K .......... .......... .......... .......... ..........  4% 14.6M 1s
module.sbeacon.null_resource.init_script (local-exec):   1000K .......... .......... .......... .......... .......... 22% 6.21M 0s
module.sbeacon.null_resource.init_script (local-exec):   1050K .......... .......... .......... .......... .......... 23%  103M 0s
module.sbeacon.null_resource.init_script (local-exec):   1100K .......... .......... .......... .......... .......... 24% 32.5M 0s
module.sbeacon.null_resource.init_script (local-exec):   1150K .......... .......... .......... .......... .......... 25%  146M 0s
module.sbeacon.null_resource.init_script (local-exec):   1200K .......... .......... .......... .......... .......... 26%  316M 0s
module.sbeacon.null_resource.init_script (local-exec):   1250K .......... .......... .......... .......... .......... 27% 59.3M 0s
module.sbeacon.null_resource.init_script (local-exec):   1300K .......... .......... .......... .......... .......... 28% 61.7M 0s
module.sbeacon.null_resource.init_script (local-exec):   1350K .......... .......... .......... .......... .......... 29% 69.4M 0s
module.sbeacon.null_resource.init_script (local-exec):   1400K .......... .......... .......... .......... .......... 31%  339M 0s
module.sbeacon.null_resource.init_script (local-exec):   1450K .......... .......... .......... .......... .......... 32% 79.4M 0s
module.sbeacon.null_resource.init_script (local-exec):   1500K .......... .......... .......... .......... .......... 33% 70.6M 0s
module.sbeacon.null_resource.init_script (local-exec):   1550K .......... .......... .......... .......... .......... 34% 76.6M 0s
module.sbeacon.null_resource.init_script (local-exec):   1600K .......... .......... .......... .......... .......... 35% 90.0M 0s
module.sbeacon.null_resource.init_script (local-exec):   1650K .......... .......... .......... .......... .......... 36%  332M 0s
module.sbeacon.null_resource.init_script (local-exec):   1700K .......... .......... .......... .......... .......... 37% 76.0M 0s
module.svep[0].null_resource.init_script (local-exec):    200K .......... .......... .......... .......... ..........  5% 5.73M 1s
module.sbeacon.null_resource.init_script (local-exec):   1750K .......... .......... .......... .......... .......... 38% 89.5M 0s
module.sbeacon.null_resource.init_script (local-exec):   1800K .......... .......... .......... .......... .......... 39% 94.4M 0s
module.sbeacon.null_resource.init_script (
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.